c5/src/Documents/ReceiptStockman/ReceiptStockman.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ReceiptStockman</name>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Invoiced</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Reveived</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Print</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/ReceiptStockman/ObjectModule.bsl
Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif;
	SetPrivilegedMode ( true );
	makeBarcodes ();
	
EndProcedure

Procedure makeBarcodes ()

	for each row in getNew () do
		r = InformationRegisters.Штрихкоды.CreateRecordManager ();
		r.Код = ОбщегоНазначения.ПолучитьНовыйКодДляШтрихКода ();
		r.Lot = row.Lot;
		r.Владелец = row.Item;
		r.ЕдиницаИзмерения = row.Package;
		r.Штрихкод = Barcodes.NewEAN13 ();
		r.Write ();
	enddo;
	
EndProcedure

Function getNew ()
	
	s = "
	|select distinct Items.Item as Item, Items.Lot as Lot, Items.Package as Package
	|from Document.Receipt.Items as Items
	|	//
	|	// Barcodes
	|	//
	|	left join InformationRegister.Штрихкоды as Barcodes
	|	on Barcodes.Lot = Items.Lot
	|	and Barcodes.ЕдиницаИзмерения = Items.Package
	|	and Barcodes.Владелец = Items.Item
	|where Items.Ref = &Ref
	|and Barcodes.Код is null
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	return q.Execute ().Unload ();
	
EndFunction
